#การอ่านไฟล์และเขียนไฟล์

file = open("chotivit.txt","r")  #อันนี้เป็นการอ่านไฟล์
print(file.read())
#ตรงด้านหลังชื่อไฟล์ที่เป็น r w a คือการ อ่าน เขียน ไฟล์

#########################################################

file = open("chotivit.txt","w") #อันนี้เป็นการเขียนไฟล์
file.write("hello chotivit") #ตรงนี้จะให้เขียนคำที่จะเขียนไปในไฟล์
file.close()#ตรงนี้จะมีหรือไม่มีก็ได้เเต่มีไว้เพื่อให้ไฟล์ทำงานได้เต็มรูปเเบบ

########################################################
file = open("chotivit.txt","a") #อันนี้จะเป็นการเขียนคำเพิ่มจากในไฟล์
file.write(" Busamongkol")
file.close() #ส่วนนี้จะเหมือนกับ write เลยเเค่เปลี่ยนจาก"w"เป็น"a"

